[
  {
    "id": 1,
    "title": "Head of Technology",
    "organization": "ActionAid International",
    "location": "Johannesburg, Nairobi, London (preference for one of these)",
    "description": "The Head of Technology is a diverse and complex role responsible for leading the technology direction, security and business management of the technology function. The role drives digital transformation, oversees IT operations for the Global Secretariat (GS) and the global federation for platform, application and infrastructure delivery to ensure reliability, robustness alongside cyber, information and data security ensuring that these areas are aligned with business objectives and appropriate technology investment. The Head of Technology is a member of the GS International Leadership Team, acting as a strategic partner to the wider federation technology teams driving collaborative initiatives and solutions.",
    "full_description": "The Head of Technology is a diverse and complex role responsible for leading the technology direction, security and business management of the technology function. The role drives digital transformation, oversees IT operations for the Global Secretariat (GS) and the global federation for platform, application and infrastructure delivery to ensure reliability, robustness alongside cyber, information and data security ensuring that these areas are aligned with business objectives and appropriate technology investment. The Head of Technology is a member of the GS International Leadership Team, acting as a strategic partner to the wider federation technology teams driving collaborative initiatives and solutions.",
    "requirements": [
      "Strong strategic leadership skills and excellent operations and infrastructure experience",
      "Conversant with Cybersecurity & Compliance",
      "Strong commitment to ActionAid’s values and ethos, including ActionAid’s feminist leadership principles",
      "Meet all essential criteria listed in the person specification (full details in job description PDF)",
      "Have the right to work in the specified locations"
    ],
    "responsibilities": [
      "Develop and execute an IT roadmap aligned with organisational growth and transformation goals",
      "Lead modernisation initiatives, including cloud operations and automation, to enhance operational efficiency and system improvement",
      "Champion the adoption of emerging technologies, including artificial intelligence",
      "Maintain security policies, standards and procedures to safeguard data, systems and personnel",
      "Ensure compliance with industry standards (e.g. GDPR, ISO 27001)",
      "Maintain robust disaster recovery and business continuity plans"
    ],
    "salary_range": "£79,842.00",
    "employment_type": "Permanent",
    "language": "en",
    "apply_url": "https://actionaidinternational.bamboohr.com/careers/226",
    "created_at": "",
    "closing_date": "2026-02-26"
  },
  {
    "id": 2,
    "title": "Specialist, BI Developer",
    "organization": "Save the Children International",
    "location": "West and Central Africa",
    "description": "The Specialist, BI Developer builds, implements, improves, supports, and analyzes Business Intelligence (BI) solutions within the organization. Partners with business stakeholders and product owners to understand analytic requirements and deliver BI solutions using best practices. Part of the global TDIT team focused on strategic planning, design, and delivery of digital and data technology solutions to support organizational goals for children.",
    "full_description": "Save the Children International has an exciting opportunity for a Specialist, BI Developer to join our global team. Team and Job Purpose: Purpose of the team is to lead on the strategic planning, design and delivery of digital and data technology solutions used across SCA. The team will be key to defining the technology strategy including roadmaps for product developments, ensuring our systems remain fit for purpose, maximising the value they deliver and enabling our organisation to achieve impact for children. Working in partnership with Transformation Delivery, the team will be accountable for planning, design and delivery of digital and data technology solutions to Transformation Delivery projects, SCI Functions and internal IT functions. Role purpose: Working with members of the global TDIT team, the role holder will be responsible for building, implementing, continuously improving, supporting and analysing Business Intelligence (BI) solutions within the organisation. This role will partner with business stakeholders and product owners in order to understand their analytic requirements and implement and maintain BI solutions to meet these needs, utilising best practices.",
    "requirements": [
      "Experience of working with SQL Server databases, including creating & modifying T-SQL scripts, stored procedures, functions, triggers, writing ad-hoc queries and dynamic SQL",
      "Experience of working closely with non-technical staff, demonstrating an ability to translate and negotiate non-technical requirements into a detailed technical specification",
      "Good interpersonal, verbal, and written communication skills with a proven ability to explain complex technical ideas and problems clearly to non-experts",
      "Self-motivated, enthusiastic, and strong problem-solving skills",
      "Cultural awareness and experience of delivering solutions internationally",
      "Keen to learn new technologies, especially in BI"
    ],
    "responsibilities": [
      "Collaborate inclusively with global TDIT team members, business stakeholders, and product owners to design and deliver comprehensive Business Intelligence solutions that support organisational goals, ensuring alignment with stakeholder requirements and best practices",
      "Estimate and deliver tasks to agreed prioritisation and timeframes in alignment with project and change request delivery methodologies",
      "Foster a culture of innovation when creating BI Solutions using ‘proof of concepts’ to demonstrate the new approaches",
      "Analyse and continuously improve BI systems and processes, ensuring they are efficient, robust, and capable of helping the organisation make data-driven decisions",
      "Collaborate with other IT Teams (e.g. testing, release management, infrastructure, architecture) to assist management in implementing and managing changes to the BI environment",
      "Provide agreed services to business functions (e.g. monthly KPI data to Program Operations team or month end stock reconciliation data to Supply Chain and Finance Teams)",
      "Proactively identify and escalate any technical risks/issues related to BI",
      "Maintain and support existing BI solutions working closely with broader Technology Services teams and in alignment with the organisation's application support ways of working",
      "Collaborate with IT Operations team and take ownership of key elements of BI infrastructure e.g. SQL high availability, performance and tuning, planning and scheduling backups and recovery pans",
      "Maintain accurate technical documentation"
    ],
    "salary_range": "N/A",
    "employment_type": "Permanent",
    "language": "en",
    "apply_url": "https://hcri.fa.em2.oraclecloud.com/hcmUI/CandidateExperience/en/sites/CX_1/jobs/preview/15356/apply/email?lastSelectedFacet=POSTING_DATES&selectedPostingDatesFacet=30",
    "created_at": "2026-02-06"
  },
  {
    "id": 3,
    "title": "Head, SCUS FMS Transition Project",
    "organization": "Save the Children International",
    "location": "West and Central Africa",
    "description": "The Head of SCUS FMS Transition Project will lead the transition to the new SaaS-based FMS for SCUS. Following the successful selection of the global solution in 2025, this role will be responsible for initiating and driving the SCUS implementation project.",
    "full_description": "A robust Financial Management System (FMS) is essential for the efficient operation of any organization. Across SCI and several Members, we currently use an FMS originally designed for SCI and later extended to opt-in Members. Due to our vendor’s transition from an on-premises solution to a SaaS model, we initiated a tender process and selected Oracle FMS as the new global solution. This system will support across SCA, including all SCI entities, and multiple Members. SCUS has committed to migrating to this shared FMS, with go-live planned for 2027. To deliver this change, a global project has been established to design and implement the solution across all participating entities. Given SCUS’s size and complexity, its local implementation must be managed effectively to minimize operational risk and maximize the value of this significant investment. The SCUS FMS Transition Project will work in close partnership with the Global FMS Project to ensure successful delivery of the global solution within SCUS. The approach will prioritize “off-the-shelf” functionality and global alignment wherever possible, while ensuring SCUS-specific requirements are understood and addressed. The Head of SCUS FMS Transition Project will lead the transition to the new SaaS-based FMS for SCUS. Following the successful selection of the global solution in 2025, this role will be responsible for initiating and driving the SCUS implementation project. Key responsibilities include: Establishing the project team and defining resource requirements. Implementing governance, controls, and reporting structures. Developing and managing project plans and budgets. Ensuring alignment with global initiatives and managing dependencies. Proactively resolving issues and escalating where necessary. This is a hands-on leadership role requiring strong problem-solving skills and the ability to navigate complex stakeholder environments. The successful candidate will have proven experience delivering large-scale, global IT transformation programs, ideally within financial systems, given the scale and impact of this change.",
    "requirements": [
      "An extensive track record of successfully managing large and complex projects and programmes that include significant system transformation managed alongside process change",
      "Demonstrable experience and in-depth knowledge of programme and project practices and standards",
      "A proven ability to deliver projects on time / on budget, using project management processes and tools including risk management, benefits management, financial management and quality assurance",
      "A proven ability to apply excellent analytical and problem-solving skills, and to work collaboratively to deliver of effective solutions to project related issues",
      "Highly developed organisational awareness and ability to understand any sensitivities within a complex multi-stakeholder structure; and think creatively and strategically to overcome obstacles to cooperation and progress",
      "Strong team leadership abilities with the ability to motivate and mobilise individuals outside their reporting line",
      "Excellent communication skills (written & oral English), including the ability to communicate and influence at all levels of the organisation",
      "Able to demonstrate instances of initiative that have delivered organisational benefits",
      "Strong practical and hands on experience of IT Systems",
      "Educated to degree level of equivalent work experience",
      "External Project and/or Change Management accreditation",
      "Understanding of a structured Project methodology (e.g. PRINCE2) or accredited Project Management training (APM or PMI) including experience leading a project using such a methodology"
    ],
    "responsibilities": [
      "Project Leadership: Including direct and indirect management of team members and accountability to the SCUS CAO and SCI CTO as well as Members of the wider SCUS SLT",
      "Governance and Senior Stakeholder Engagement: Define, implement and manage governance and engagement with wider senior leaders as well as setting up and managing reference groups to ensure input from key individuals has a forum for the duration of the project",
      "Planning and Reporting: Including ensuring alignment with standard Project and Change Methodologies and associated Portfolio Management requirements",
      "Budget Management: Define and monitor ongoing management of the budget for the project, ensuring compliance with required processes and any issues are escalated and managed effectively in a timely way",
      "Future State Definition: Detailed definition of the future operating model and actions required to achieve the required change including all impacts on people, processes, data and technology",
      "Dependency Management: Working effectively with wider initiatives and functions to ensure dependencies are understood and actively managed with clear owners and accountability ensured",
      "Problem Solving: All projects face challenges along the way and the Project Lead will need to take a hands on role to identify issues and ensure they are effectively managed through to resolution and any subsequent impacts are reported to governance in a timely way"
    ],
    "salary_range": "N/A",
    "employment_type": "Fixed-term (18 months)",
    "language": "en",
    "apply_url": "https://hcri.fa.em2.oraclecloud.com/hcmUI/CandidateExperience/en/sites/CX_1/jobs/preview/15196/apply/email?lastSelectedFacet=POSTING_DATES&selectedPostingDatesFacet=30",
    "created_at": "2026-01-29"
  },
  {
    "id": 4,
    "title": "Head, Global Shared Services for CRM Project",
    "organization": "Save the Children International",
    "location": "West and Central Africa",
    "description": "Initiate and deliver on our priorities for this initiative; to include ensuring we have a clear strategy and path to reach our defined outcomes whilst also prioritising delivering the required deployments and associated quick wins where relevant.",
    "full_description": "In Save the Children, we currently have a diverse landscape of Customer Relationship Management (CRM) platforms in use. With this project, we are implementing a Global CRM System, for fundraising across some key fundraising markets and implementing a set of Global Shared Services for the benefit of our global movement, with an immediate focus on small clusters of member countries that are using the same CRM platforms but acting independently or in the process of migrating CRM. Through delivery of this project, we aim to explore the potential to offer a variety of Shared Services on these common CRM platforms and well as expand opportunities and delivery of deployments of the Global CRM solution across Save the Children, maximising our ability to interact with their donors and to enhance our global fundraising capabilities. It is a complex project, with a high level of visibility and will require senior level engagement with stakeholders from across the movement. Initiate and deliver on our priorities for this initiative; to include ensuring we have a clear strategy and path to reach our defined outcomes whilst also prioritising delivering the required deployments and associated quick wins where relevant. Our intention is to complete a feasibility assessment to understand the deployment impact and options to move forwards with SCUS adoption, identify the scope to complete the feature enhancement development of Global CRM along with complete other Member and Country Office deployment opportunities as they progress and present themselves. The Project Lead will be accountable for delivery of this assessment as well as delivery of deployments across markets and maximising adoption. This will include setting up and managing governance, ensuring the required team / reference groups are in place, working with wider project team to complete current and future state analysis, determining options to move forwards, identifying and proposing mitigations for project risks and issues, defining costs and benefits and coordinate the required governance to move the completed feasibility assessments and deployments through the project delivery and approvals process. It will be critical to ensure a robust plan is managed both in terms of feasibilities and deployment delivery and to indicate expected timelines for the later phases of each project once the way forwards has been signed off. The Lead will also need to effectively coach and guide the project team, ensuring they are held accountable for delivery.",
    "requirements": [
      "Considerable experience in the leadership, management and deployment of large, global, transformation projects within Save the Children and additional equivalent scale organisation across both system and non-system change",
      "Hands on experience of complex CRM deployments, in a Fundraising Capacity, from feasibility through to design, develop and deployment",
      "Experience leading the setup of large-scale Global Transformation initiatives including recruitment of key roles, governance setup and functional alignment",
      "Familiarity with industry project (agile and waterfall) and change management standards including evidence of completing formal training, with the ability to hold project teams accountable to those standards",
      "Demonstrated experience leading engagement with Senior Leaders up to Board level and partnering with functional leaders across multiple functions",
      "Ability to lead the resolution of complex project issues with a balanced approach of pragmatism and rigour including experience leading others to deliver the required interventions and managing associated governance",
      "Line Management experience, including leading teams with multi layered hierarchies",
      "Proven ability to operate successfully within a matrix organisation structure, overseeing resource without direct line management accountability and being experienced working across multiple different functional areas",
      "Operational expertise working with Digital technologies focused on transforming an organisation's ability to achieve data driven decision making",
      "Educated to degree level of equivalent work experience",
      "External Project and/or Change Management accreditation"
    ],
    "responsibilities": [
      "Project Leadership: Including direct and indirect management of team members and accountability to the CTO and SLT from impacted members on delivery of the Project",
      "Governance and Senior Stakeholder Engagement: Define, implement and manage Governance and Engagement with wider Senior leaders as well as setting up and managing reference groups to ensure input from key individuals has a forum for the duration of the Project",
      "Planning and Reporting: Including ensuing alignment with standard Project and Change Methodologies and associated Portfolio management requirements",
      "Budget management: Define and monitor ongoing management of the Budget for the Project, ensuring compliance with required processes and any issues are escalated and managed effectively in a timely way",
      "Future State Definition: Detailed Definition of the Future operating model and actions required to achieve the required Change Including all impacts on people (programme participants, partners and staff), processes, data and technology",
      "Dependency management: Working effectively with wider initiatives and functions to ensure dependencies are understood and actively managed with clear owners and accountability ensured",
      "Problem Solving: all projects face challenges along the way, and the Project Lead will need to take a hands on role to identify issues and ensure they are effectively managed through to resolution and any subsequent impacts are reported to Governance in a timely way"
    ],
    "salary_range": "N/A",
    "employment_type": "Permanent",
    "language": "en",
    "apply_url": "https://hcri.fa.em2.oraclecloud.com/hcmUI/CandidateExperience/en/sites/CX_1/jobs/preview/15194/apply/email?lastSelectedFacet=POSTING_DATES&selectedPostingDatesFacet=30",
    "created_at": "2026-01-29"
  },
  {
    "id": 6,
    "title": "Network Administrator",
    "organization": "Amref International University",
    "location": "Nairobi, Kenya",
    "description": "The Network Administrator is responsible for designing, implementing, maintaining, and supporting the university's network infrastructure to ensure reliable and secure connectivity across all campus locations.",
    "full_description": "Amref International University focuses on training, research and extension in health sciences, emphasizing promotive, preventive, rehabilitative and palliative health. AmIU is founded on the experience and intellect of Amref Health Africa, which is reputed for its over 60 years of quality and innovative public and community health interventions, training, and education. It is committed to progressively developing innovative programmes catering to the present and future African and global health needs. The University offers postgraduate, undergraduate, higher diploma, diploma· and certificate programmes and Continuing Professional Development (CPD) courses that prepare human resources for health to serve throughout the health system. AmIU will become the Pan African University in Primary Health care and seeks to train transformational leaders who will Inspire Lasting Change. The Network Administrator is responsible for designing, implementing, maintaining, and supporting the university's network infrastructure to ensure reliable and secure connectivity across all campus locations.",
    "requirements": [
      "Bachelor's degree in Computer Science, Information Technology, Network Engineering, or related field from a recognized institution",
      "Cisco CCNA, Meraki Certification (CMNA or CMNO) - MANDATORY",
      "Minimum 3-5 years of experience in network administration",
      "Proven experience with Cisco Meraki cloud-managed networking solutions",
      "Experience managing large-scale enterprise networks",
      "Hands-on experience with network monitoring and troubleshooting tools",
      "Expert knowledge of Cisco Meraki dashboard and cloud-managed networking",
      "Strong understanding of TCP/IP, routing protocols, switching, and VLANs",
      "Proficiency in network security principles and implementation",
      "Experience with wireless network design and deployment",
      "Knowledge of network monitoring tools and network management systems",
      "Excellent problem-solving and analytical skills",
      "Strong communication and interpersonal skills",
      "Ability to work independently and collaboratively",
      "Leadership and team management abilities",
      "Self-motivated with strong organizational skills"
    ],
    "responsibilities": [
      "Design, configure, and maintain the university's LAN, WAN, and wireless networks",
      "Manage and optimize Cisco Meraki network equipment including switches, access points, and security appliances",
      "Monitor network performance and implement upgrades and expansions as needed",
      "Implement and maintain network security measures including firewalls, VLANs, and access controls",
      "Monitor network traffic for security threats and unauthorized access",
      "Collaborate with the cybersecurity team to ensure compliance with security policies",
      "Provide technical support for network-related issues to staff and students",
      "Diagnose and resolve network problems promptly to minimize downtime",
      "Coordinate with vendors and service providers for network services and support",
      "Maintain accurate network documentation including diagrams, configurations, and procedures",
      "Generate regular reports on network performance, capacity, and incidents",
      "Document all network changes and maintain change management records",
      "Supervise and mentor Network Support Specialists and related technical staff",
      "Participate in ICT strategic planning and budgeting processes",
      "Stay current with emerging networking technologies and recommend improvements"
    ],
    "salary_range": "N/A",
    "employment_type": "Full-time",
    "language": "en",
    "apply_url": "https://jobs.smartrecruiters.com/AmrefHealthAfrica4/744000107730237-network-administrator",
    "created_at": "N/A"
  },
  {
    "id": 7,
    "title": "Cloud Architect",
    "organization": "World Vision International",
    "location": "Ghana, Kenya (Hybrid/Remote)",
    "description": "As a Cloud Architect, you will design and lead the implementation of security-first cloud-based solutions across AWS and Azure to empower field teams and improve program delivery.",
    "full_description": "With 75 years of experience, our focus is on helping the most vulnerable children overcome poverty and experience fullness of life. We help children of all backgrounds, even in the most dangerous places, inspired by our Christian faith. As our Cloud Architect, you will design and lead the implementation of cloud-based solutions that empower field teams, improve program delivery, and ensure organizational resilience. You will embed a security-first leadership mindset into every stage of solution design and delivery—ensuring that security, compliance, and resilience are core drivers of technology decisions. You'll collaborate closely with IT, program leads, and partners to align cloud infrastructure with both technical needs and humanitarian outcomes. You will be responsible for leading platform design, governance, and team development, enabling reliable, secure, and high-performing systems that empower field operations, digital services, and data-driven decision-making.",
    "requirements": [
      "Bachelor's or Master's degree in Computer Science, Engineering, or related field",
      "7+ years in IT with 3+ years in cloud architecture or platform leadership",
      "Hands-on experience designing and deploying workloads on both AWS and Azure",
      "Strong understanding of networking, IAM, data services, and container orchestration",
      "Deep understanding of infrastructure-as-code, DevOps, and cloud security principles",
      "Expertise with IaC tools like Terraform or CloudFormation and CI/CD pipelines",
      "Experience with scripting languages such as Python or PowerShell",
      "Ability to lead with a security-first mindset and influence stakeholders"
    ],
    "responsibilities": [
      "Implement a strategic roadmap for cloud adoption and optimization",
      "Lead the design of hybrid and multi-cloud solutions across AWS and Azure",
      "Develop reference architectures, solution blueprints, and technical standards",
      "Oversee end-to-end delivery of cloud projects from discovery to deployment",
      "Integrate cloud platforms with internal systems like CRM, ERP, and data platforms",
      "Embed security practices including encryption, IAM, and zero-trust principles",
      "Ensure compliance with global data protection laws such as GDPR and HIPAA",
      "Lead business continuity and disaster recovery strategies",
      "Mentor junior architects and engineers and lead review boards",
      "Manage relationships with AWS and Azure account teams and optimize cloud spend"
    ],
    "salary_range": "Competitive",
    "employment_type": "Full-time",
    "language": "en",
    "apply_url": "[https://worldvision.wd1.myworkdayjobs.com/en-US/WorldVisionInternational/job/Director-of-Cloud-Strategy-and-Operations_JR38192](https://worldvision.wd1.myworkdayjobs.com/en-US/WorldVisionInternational/job/Director-of-Cloud-Strategy-and-Operations_JR38192)",
    "created_at": "N/A"
  },
  {
    "id": 8,
    "title": "Digital Workplace Analyst",
    "organization": "World Vision International",
    "location": "Nairobi, Kenya",
    "description": "The Digital Workplace Analyst (DWA) is responsible to deliver the best digital workplace experience to staff. S/he is responsible for areas like communication, collaboration, mobility, productivity workplace applications and workplace innovations to enable staff to perform in a modern and engaging workplace where technology makes the difference. This is an entry level position and the scope is Nairobi.",
    "full_description": "The Digital Workplace Analyst (DWA) is responsible to deliver the best digital workplace experience to staff. S/he is responsible for areas like communication, collaboration, mobility, productivity workplace applications and workplace innovations to enable staff to perform in a modern and engaging workplace where technology makes the difference. This is an entry level position and the scope is Nairobi. The staff will serve as a user liaison, providing guidance on business usage, and communications for the digital workplace product suite. They respond to requests for IT support, logging problems, generating tickets, attempting to diagnose and resolve problems, and if necessary, escalating the problem to the appropriate level of expertise. The DWA works closely with the user community and the IT teams especially with the DWAs in the field offices to continually improve the digital dexterity of the users, and in turn, grow their tech-savviness in the usage of IT solutions in their daily roles at the workplace. They are the change champions for utilization of IT tools and systems.",
    "requirements": [
      "Bachelor's degree in computer science, Information Technology, BBIT, Electrical and Electronic Engineer or other related specialized training, or equivalent work experience.",
      "Technical certification in one or more IT disciplines or technology (Microsoft, ITIL v4, GVF etc).",
      "At least 1 years’ work experience in operation of enterprise IT networks.",
      "Minimum 3 years’ experience in a similar role with advanced network, cloud and/or systems related vendor certifications.",
      "Extensive experience with Windows 11, MAC OSX desktop platforms and Android and IOS mobile platforms.",
      "Proficient in MS Office (Word, Excel, PowerPoint) and other business tools such as Zoom and Microsoft Teams.",
      "Proficient with SharePoint Online, MS Teams, MS Stream, Power Platform.",
      "Exceptional analytic and troubleshooting skills for solving problems.",
      "Good customer service skills and experience.",
      "Ability to relate technical issue to a largely non-technical audience.",
      "Effective in written and verbal communication in English.",
      "Strong ability to work as part of a team and coordinate with all staff.",
      "Good problem solving and analytical skills.",
      "Able to work under tight deadline and cope with pressure.",
      "Knowledge of configuring and administering Microsoft SharePoint using Central Administration and PowerShell."
    ],
    "responsibilities": [
      "Provide support to develop, implement, operate and maintain End User Digital Technologies.",
      "Facilitates and provides input to the design/development process.",
      "Translate stakeholder business objectives and drivers to identify digital workspace opportunities and establish appropriate solutions.",
      "Support development of customer satisfaction levels and ensure they are achieved through established metrics against SLAs.",
      "Establish definition and implementation of virtual, physical and mobile digital workspace solutions. Develop and establish the digital workplace environment.",
      "Make recommendations in the adoption, and innovative use of digital IT workspace technologies to improve business and teaching/learning processes, communication and collaboration.",
      "First point of contact and day-to-day technical support to end users – in Nairobi. Triage, resolve or escalate reported incidents and problems.",
      "Generates activity and status reports.",
      "Provides the user access service.",
      "Research on trouble issues which affect multiple clients.",
      "Reviews checklists and scripts.",
      "Works with vendor technical support personnel on solutions for clients.",
      "Provides responsive support for problems found during normal working hours as well as outside normal working hours.",
      "Participates in deployment of new or upgrade information technology and infrastructure projects, including assisting co-workers and vendor partners in Nairobi.",
      "Installs and performs minor repairs to hardware, software, and peripheral equipment, following design or installation specifications.",
      "Coordinate and maintain regular communication with warranty and service providers to ensure timely servicing and maintenance of office equipment, including printers and other IT assets.",
      "Provides on-going support of client technology.",
      "Ensures that all technical resources are available for meetings that include video conferencing.",
      "Diagnoses and resolves client workstation and mobile device hardware and software issues.",
      "Provide technical support on enterprise IT services and personal productivity tools (Finance, HRIS, SCM solutions, O365 messaging & collaboration, Zoom, OneDrive etc).",
      "Develop customer experience journey mapping.",
      "Develop, review, measure and report customer experience metrics (Net Promoter Score).",
      "Support the process of closing customer feedback loop for Continuous Service Improvement.",
      "Lead the continuous improvement of digital IT workspace service improvements and offerings to end users via proactive measurement, evaluation and ideation.",
      "Conduct regular customer experience and satisfaction surveys.",
      "Works with the DWS to coordinate the process of conducting training needs assessment.",
      "Provides documentation, training, and guidance for IT clients.",
      "Establish training content (webinar/documents/video) and facilitates online and onsite training for all deployed client solutions.",
      "Supervise on site preventative maintenance of infrastructure in Nairobi.",
      "Coordinate technician’s travels to the field for any equipment maintenance in the field offices for Nairobi based vendors.",
      "Monitors services provided by vendors to ensure service levels meet requirements.",
      "Evaluates vendor solutions to ensure compliance with requirements and cost-effectiveness at the digital workplace.",
      "Engages the hardware vendors on issues to remedy issues or escalates for support including warranty support.",
      "May resolve invoice discrepancies.",
      "Coordinate with Supply chain and DWA’s in field on dispatch of ICT assets going to the different regions in the field.",
      "Work with the vendor to resolve the infrastructure challenges."
    ],
    "salary_range": "N/A",
    "employment_type": "Full-time",
    "language": "en",
    "apply_url": "https://worldvision.wd1.myworkdayjobs.com/en-US/WorldVisionInternational/job/Digital-Workplace-Analyst_JR48103",
    "created_at": "N/A"
  },
  {
    "id": 9,
    "title": "Network and Security Analyst",
    "organization": "World Vision International",
    "location": "Kigali, Rwanda",
    "description": "Design, install and support the VFR’s IT network Infrastructures including operating systems, business supporting software, security tools, servers, email systems and Hardware (laptops, PCs, tablets, printers, scanners). Install and configure local area networks (LANs), wide area networks (WANs), and network segments and servers, such as file servers, firewalls, VPN gateways, and intrusion detection systems. Manage the system security, availability and reliability and timely troubleshoots any system failures.",
    "full_description": "Design, install and support the VFR’s IT network Infrastructures including operating systems, business supporting software, security tools, servers, email systems and Hardware (laptops, PCs, tablets, printers, scanners). Install and configure local area networks (LANs), wide area networks (WANs), and network segments and servers, such as file servers, firewalls, VPN gateways, and intrusion detection systems. Manage the system security, availability and reliability and timely troubleshoots any system failures. Ensures an effective and validated Disaster Recovery infrastructure exists for HQ and branch data. Develops and maintains an infrastructure system and cybersecurity and monitoring strategy. Ensuring IT system performance and providing technical assistance for system improvements and modifications as required. Perform active directory administration for the system network user/Computer accounts, access permissions, rights and space allocations. Develop and execute a disaster recovery plan and procedures. Perform vulnerability assessments, penetration testing sessions on the VFR Infrastructure periodically as per defined by VFR Policies and ensure recommended network configuration remediation actions are timely executed. Ensuring the development and updating of an IT systems and equipment inventory.",
    "requirements": [
      "Bachelor's degree in computer Science, Information technology, Cybersecurity, or related field",
      "5 years of experience in IT infrastructure, systems administration, or IT security management.",
      "Experience with firewalls, routers, switches (Cisco, Sophos, etc.)",
      "Strong background in systems administration, network security, and incident response, along with a proactive approach to safeguarding information assets.",
      "Familiarity with setting up of the Network connectivity in banking sector or any complex environments",
      "Hands on experience of LAN and Servers installation, configuration and support;",
      "Experience with firewalls, anti-virus software, intrusion detection, intrusion prevention systems.",
      "Experience in installing, configuring, administering and deploying Windows Server-based and Linux Server-based systems.",
      "Experience in network Attached Storage Implementations, Windows Server and Desktop administration.",
      "Knowledge of one of the virtualization technologies such as Hyper-V, virtual box, proxmox, VMWare, etc.",
      "Knowledge of Network monitoring, disaster recovery tools, technologies and methods."
    ],
    "responsibilities": [
      "Design, install and support the VFR’s IT network Infrastructures including operating systems, business supporting software, security tools, servers, email systems and Hardware (laptops, PCs, tablets, printers, scanners).",
      "Install and configure local area networks (LANs), wide area networks (WANs), and network segments and servers, such as file servers, firewalls, VPN gateways, and intrusion detection systems.",
      "Manage the system security, availability and reliability and timely troubleshoots any system failures",
      "Ensures an effective and validated Disaster Recovery infrastructure exists for HQ and branch data.",
      "Develops and maintains an infrastructure system and cybersecurity and monitoring strategy",
      "Ensuring IT system performance and providing technical assistance for system improvements and modifications as required.",
      "Perform active directory administration for the system network user/Computer accounts, access permissions, rights and space allocations.",
      "Develop and execute a disaster recovery plan and procedures.",
      "Perform vulnerability assessments, penetration testing sessions on the VFR Infrastructure periodically as per defined by VFR Policies and ensure recommended network configuration remediation actions are timely executed.",
      "Ensuring the development and updating of an IT systems and equipment inventory."
    ],
    "salary_range": "N/A",
    "employment_type": "Full-time",
    "language": "en",
    "apply_url": "https://worldvision.wd1.myworkdayjobs.com/en-US/WorldVisionInternational/job/Network-and-Security-Analyst_JR42498",
    "created_at": "N/A"
  },
  {
    "id": 10,
    "title": "Cloud Database Administrator (Cloud DBA)",
    "organization": "World Vision International",
    "location": "Home Working, Kenya",
    "description": "The Cloud Database Administrator (Cloud DBA) is responsible for the performance, integrity, and security of cloud-based databases across global systems. This role supports both operational and strategic initiatives, ensuring that database services are scalable, resilient, and optimized to support humanitarian and development programs worldwide.",
    "full_description": "The Cloud Database Administrator (Cloud DBA) is responsible for the performance, integrity, and security of cloud-based databases across global systems. This role supports both operational and strategic initiatives, ensuring that database services are scalable, resilient, and optimized to support humanitarian and development programs worldwide.",
    "requirements": [
      "Bachelor’s degree in programming/systems, computer science, information systems, or mathematics, specialized training, certification or equivalent work experience.",
      "Has a broad level of understanding surrounding information systems and application and/or web standards.",
      "Preference will be given to candidates with experience in Terraform and Azure DevOps. Familiarity with GitHub Actions, Ansible, or scripting tools such as PowerShell or Python is highly desirable.",
      "Security-first mindset is essential in all aspects of cloud infrastructure and operations.",
      "Strong understanding of IT Operations Management (ITOM) and database observability.",
      "Experience with public cloud platforms (Azure, AWS) and cloud-native database services.",
      "Problem-solving skills with a value-driven mindset, focusing on service optimization and reliability.",
      "Customer-centric approach—understanding how database performance impacts end-user experience and business outcomes.",
      "Strong scripting and automation skills (e.g., PowerShell, Terraform, Python) for DevOps integration."
    ],
    "responsibilities": [
      "Provide support, guidance, and collaboration to field office IT staff across all regions to ensure consistent service delivery and alignment with global standards.",
      "Manage and maintain cloud-based databases (e.g., Azure SQL, Amazon RDS, PostgreSQL, MySQL) across production and non-production environments.",
      "Implement and monitor backup, high availability, and disaster recovery strategies.",
      "Optimize database performance through indexing, tuning, and automation.",
      "Ensure database security and compliance with organizational and regulatory requirements.",
      "Collaborate with developers, architects, and infrastructure teams to support application performance and scalability.",
      "Implement Infrastructure as Code (IaC) practices for consistent and automated database deployments.",
      "Conduct proactive monitoring and capacity planning using ITOM tools.",
      "Work collaboratively within Agile teams, embracing iterative delivery, continuous improvement, and adaptive planning as part of the organization's new ways of working."
    ],
    "salary_range": "N/A",
    "employment_type": "Full-time",
    "language": "en",
    "apply_url": "https://worldvision.wd1.myworkdayjobs.com/en-US/WorldVisionInternational/job/Cloud-Database-Administrator--Cloud-DBA-_JR43348",
    "created_at": "N/A"
  },
  {
    "id": 11,
    "title": "Senior Manager, Digital Platforms & Infrastructure Applications Management",
    "organization": "World Vision International",
    "location": "Home Working, Kenya",
    "description": "The Senior Manager, Digital Workplace & Enterprise Platforms is responsible for leading the global management, modernisation, and operational support of the organization’s shared digital platforms. This includes Microsoft 365 productivity tools, Box, cloud databases, and legacy systems such as Domino. The role plays a critical part in driving platform consolidation, enabling secure and scalable collaboration services, and supporting digital workplace adoption across both global offices and field offices.",
    "full_description": "As a key leader within the Infrastructure & Operations function, this role partners closely with teams across Cybersecurity, Architecture, TBM (Digital Workplace, Governance), Field IT, and Application Support to ensure end-to-end performance, user satisfaction, and modernization of the digital platforms' ecosystem.",
    "requirements": [
      "Bachelor’s Degree in Computer Science, Information Systems, or other related field. Or equivalent work experience.",
      "Requires experience in supervising and building relationships with people at a variety of levels.",
      "Typically has 7 to 10 years of relevant IT and business work experience.",
      "Requires demonstrated ability to launch and deliver a single IT project on time and within budget.",
      "Strong technical understanding of Microsoft 365, cloud database environments (e.g., Azure SQL), Box, and Domino.",
      "Demonstrated success in managing platform transitions, system upgrades, and modernization programs.",
      "Working knowledge of Agile delivery methods and coaching teams in iterative improvement.",
      "Foundational knowledge of Agile principles and practices, with the ability to contribute effectively in cross-functional Agile teams.",
      "Security-first mindset with experience in identity, access management, and data compliance.",
      "Excellent collaboration and stakeholder engagement skills across global, cross-functional teams.",
      "Experience working in humanitarian or decentralized global organizations is desirable."
    ],
    "responsibilities": [
      "Oversee the operational delivery and lifecycle management of shared collaboration and productivity platforms including Microsoft 365, Box, cloud-native databases, and Domino servers.",
      "Drive modernization of the shared application environment, leading efforts to decommission legacy platforms and migrate to scalable, cloud-native solutions.",
      "Ensure platforms are secure, compliant, and optimized for both field and office environments, in collaboration with the Cybersecurity team.",
      "Oversee technical operations, system upgrades, licensing, and vendor management across shared applications.",
      "Partner with Architecture and ITSM teams to ensure platform integration, service reliability, and alignment with governance standards.",
      "Act as a senior escalation point for major incidents, critical risks, and operational challenges, ensuring timely resolution and stakeholder communication.",
      "Collaborate across GTD business units to ensure consistent delivery, platform usability, and continuous improvement.",
      "Collaborate with the Digital Workplace team (under TBM) to support adoption goals, contribute to platform governance, and ensure operational readiness of roadmap initiatives.",
      "Coach and mentor teams in Agile ways of working, fostering iterative delivery and platform evolution.",
      "Provide platform support guidance to regional and field IT teams, ensuring accessibility and functionality in low-connectivity settings.",
      "Contribute to adoption strategies of the digital workplace in partnership with the TBM team.",
      "Work collaboratively within Agile teams, embracing iterative delivery, continuous improvement, and adaptive planning as part of the organization's new ways of working."
    ],
    "salary_range": "N/A",
    "employment_type": "Full-time",
    "language": "en",
    "apply_url": "https://worldvision.wd1.myworkdayjobs.com/en-US/WorldVisionInternational/job/Senior-Manager--Digital-Platforms---Infrastructure-Applications-Management_JR43353",
    "created_at": "N/A"
  },
  {
    "id": 12,
    "title": "Customer Support Analyst",
    "organization": "World Vision International",
    "location": "Lusaka, Zambia",
    "description": "World Vision Zambia is seeking a highly motivated and customer focused Help Desk Support Technician (Level 1) professional to join our Global Technology & Digital Solutions team. This frontline role provides timely, high-quality technical support to staff, ensuring seamless access to digital tools, secure systems, and IT services that enable ministry excellence and operational impact.",
    "full_description": "Serve as the first point of contact for IT support, resolving Level 1 incidents and service requests in a professional and customer-centric manner. Support the setup, configuration, and maintenance of ICT assets including laptops, software, collaboration tools, and user accounts. Provide onboarding and digital training for new staff, ensuring quick adoption of ICT systems and tools. Maintain accurate IT asset inventory and support procurement activities, vendor follow-ups, and warranty processes. Support Office 365, Teams, Zoom, SharePoint, and other collaboration platforms to enhance communication and productivity. Uphold cybersecurity standards, promote user awareness, and ensure compliance with IT controls. Contribute to innovation by identifying service improvement opportunities, recommending automation, and participating in digital transformation initiatives.",
    "requirements": [
      "Bachelor’s degree in IT, Computer Science, Information Systems, or related field.",
      "1–3 years of experience in technical support or help desk roles.",
      "Strong knowledge of Microsoft 365, collaboration tools, and basic IT troubleshooting.",
      "Familiarity with IT Service Management (ITSM) tools and ITIL practices.",
      "Excellent communication, problem-solving, and customer service skills.",
      "Passion for innovation and continuous improvement.",
      "Alignment with World Vision’s Christian values and commitment to servant leadership."
    ],
    "responsibilities": [
      "Serve as the first point of contact for IT support, resolving Level 1 incidents and service requests in a professional and customer-centric manner.",
      "Support the setup, configuration, and maintenance of ICT assets including laptops, software, collaboration tools, and user accounts.",
      "Provide onboarding and digital training for new staff, ensuring quick adoption of ICT systems and tools.",
      "Maintain accurate IT asset inventory and support procurement activities, vendor follow-ups, and warranty processes.",
      "Support Office 365, Teams, Zoom, SharePoint, and other collaboration platforms to enhance communication and productivity.",
      "Uphold cybersecurity standards, promote user awareness, and ensure compliance with IT controls.",
      "Contribute to innovation by identifying service improvement opportunities, recommending automation, and participating in digital transformation initiatives."
    ],
    "salary_range": "N/A",
    "employment_type": "Full-time",
    "language": "en",
    "apply_url": "https://worldvision.wd1.myworkdayjobs.com/en-US/WorldVisionInternational/job/Customer-Support-Analyst_JR47013",
    "created_at": "N/A"
  },
  {
    "id": 13,
    "title": "IT Operations Assistant",
    "organization": "International Institute of Tropical Agriculture",
    "location": "Ibadan, Oyo State Nigeria",
    "description": [
      "The International Institute of Tropical Agriculture (IITA) is a not-for-profit institution that generates agricultural innovations to meet Africa’s most pressing challenges of hunger, malnutrition, poverty, and natural resource degradation"
    ],
    "full_description": [
      "The International Institute of Tropical Agriculture (IITA) is a not-for-profit institution that generates agricultural innovations to meet Africa’s most pressing challenges of hunger, malnutrition, poverty, and natural resource degradation. Working with various partners across sub-Saharan Africa, we improve livelihoods, enhance food and nutrition security, increase employment, and preserve natural resource integrity. IITA is a member of CGIAR, a global agriculture research partnership for a food secure future"
    ],
    "requirements": [
      "HND / Bachelor's Degree in Computer Science / Engineering, Electrical/ Mechanical Engineering, Information Technology or related field with a minimum of two (2) years' experience performing a similar role in a well-structured environment.",
      "The ideal candidate must:",
      "Display excellent client relation, and Management",
      "Have good Customer Services, Relation and communication skills.",
      "Have sound knowledge of Microsoft Client Technologies Management Windows (10,11) and MacOS."
    ],
    "responsibilities": [
      "Accurately document instances of hardware failure, repair, installation and removal and pass them to the Supervisor where necessary.",
      "Repair computers, peripherals, network equipment, software, printers and A/V systems that require specialized computer and electronic repair skills to maintain computer and network equipment safely and in a functional operating system.",
      "Perform desktop fixes, including installing, upgrading, configuring parameters, systems and application software and ensure that the anti-virus software and virus definitions are up-to-date.",
      "Work on assigned tickets already logged via the institutional helpdesk – Freshworks",
      "Log, receive and respond to incident/ request/ problem on Freshworks.",
      "Follow-up on all tickets assigned and from end-user to completion and resolutions.",
      "Ensure that all requests and enquiries on IT matters and activities are promptly attended to and closed correctly with the appropriate response to the satisfaction of the customer.",
      "Work with end-users to identify and deliver required PC service levels.",
      "Asses malfunction of computer hardware of software applications to determine appropriate action to maintain computer and network operations.",
      "Perform any other duty as may be directed by the Supervisor."
    ],
    "salary_range": "N/A",
    "employment_type": "Contract (On-site)",
    "language": "en",
    "apply_url": "https://ngojobsinafrica.com/job/it-operations-assistant-4/",
    "created_at": "February 14, 2026",
    "closing_date": "February 21, 2026"
  },
  {
    "id": 14,
    "title": "Country Data Collection Team Leads – Libya, Somalia, Kenya, OPT (Gaza)",
    "organization": "Ektimisi",
    "location": "Kenya, Libya, Somalia",
    "description": "Ektimisi is seeking Country Team Leads based in Libya, Somalia, Kenya, and OPT (Gaza)",
    "full_description": [
      "Ektimisi is seeking Country Team Leads based in Libya, Somalia, Kenya, and OPT (Gaza) who possess:",
      "Valid legal registration allowing them to operate and collect data in-country",
      "An established local field team capable of conducting data collection activities",
      "The Country Team Lead will coordinate field enumerators, manage data-collection operations, ensure quality assurance, and serve as the primary operational focal point for assignments implemented in their country of registration."
    ],
    "requirements": [
      "Legal registration (organization or company) permitting research and data-collection activities in Libya, Somalia, Kenya, or Gaza.",
      "Operational field team with proven capacity to conduct surveys, KIIs, FGDs, or similar data-collection methodologies.",
      "Minimum 4 years of field coordination or research implementation experience in humanitarian or development contexts.",
      "Proven experience managing enumerators and supervising field data collection.",
      "Fluency in relevant local language(s) and working English.",
      "Strong experience with digital data-collection platforms (e.g., KoboToolbox) and Excel-based data review.",
      "Demonstrated engagement with local authorities, communities, and stakeholders.",
      "University degree in social sciences, development, or related discipline (preferred)."
    ],
    "responsibilities": [
      "Recruit, train, and supervise field enumerators.",
      "Maintain an active roster of trained enumerators for rapid deployment.",
      "Coordinate and oversee all in-country data-collection activities.",
      "Ensure compliance with national legal requirements for research and data collection.",
      "Plan field logistics, transportation, permissions, and access arrangements.",
      "Ensure adherence to ethical standards, informed consent, and data-protection protocols.",
      "Monitor daily data-collection quality, completeness, and timeliness.",
      "Review datasets and provide technical feedback to enumerators.",
      "Produce concise field updates and incident reports.",
      "Serve as the primary coordination focal point between Ektimisi and in-country teams.",
      "Participate in technical and operational coordination meetings.",
      "Support contextual analysis and contribute to reporting when required."
    ],
    "salary_range": "N/A",
    "employment_type": "Consultancy (daily-rate based)",
    "language": "en",
    "apply_url": "https://ngojobsinafrica.com/job/country-data-collection-team-leads-libya-somalia-kenya-opt-gaza/",
    "created_at": "February 14, 2026",
    "closing_date": "Rolling basis"
  },
  {
    "id": 15,
    "title": "Information and Communications Technology (ICT) Officer (P2) N'Djamena, Chad",
    "organization": "International Organization for Migration (IOM)",
    "location": "N'Djamena, Chad",
    "description": "Applications are welcome from first- and second-tier candidates, particularly qualified female candidates as well as applications from the non-represented member countries of IOM.",
    "full_description": [
      "Applications are welcome from first- and second-tier candidates, particularly qualified female candidates as well as applications from the non-represented member countries of IOM. For all IOM vacancies, applications from qualified and eligible first-tier candidates are considered before those of qualified and eligible second-tier candidates in the selection process.",
      "For the purpose of this vacancy, the following are considered first-tier candidates:",
      "Internal candidates Candidates from the following IOM Member States that are not represented among staff members in the Professional and higher categories: Antigua and Barbuda, Bahamas, Barbados, Comoros, Congo (the), Cook Islands, Dominica, Federated States of Micronesia, Grenada, Guinea-Bissau, Holy See, Iceland, Israel, Kiribati, Marshall Islands, Namibia, Nauru, Palau, Saint Kitts and Nevis, Saint Lucia, Samoa, Sao Tome and Principe, Seychelles, Solomon Islands, Suriname, Tonga, Tuvalu, Vanuatu",
      "Second tier candidates include: All external candidates, except candidates from non-represented member states of IOM."
    ],
    "requirements": [
      "Master's degree in Computer Science, Information Management, Information Technology, or a related field from an accredited academic institution with two years of relevant professional experience; or,",
      "University degree in the above fields with four years of relevant professional experience."
    ],
    "responsibilities": [
      "Supervise missions' ICT team members and coordinate daily activities of the Information and Communications Technology (ICT) Unit for the mission, ensuring that all requests are addressed timely and accurately, and that all daily operations are in compliance with IOM ICT Standards.",
      "Ensure adherence to IOM standard, Policies, and guidelines with regards to network systems, IT security, software licensing, telecoms, and ICT procurement.",
      "Facilitate the implementation and compliance of the cyber security program and other required compliance with donor and operational frameworks and standards.",
      "Liaise with the IMT Officer for the adequate and timely provision of ICT and Information management solutions and services to meet operational needs.",
      "Ensure the required performance and stability of network services and servers (LAN, WAN, Messaging, O365, internet connectivity, etc.), to prevent and minimize downtime or service interruptions.",
      "Ensure the adequate IT infrastructure performance for mission-critical and CAS operations applications, corporate applications such as STAR, MiMOSA, E-medical, PRISM, Intranet etc.",
      "Facilitate the in-house development of required database information systems to support mission operations.",
      "Produce and implement, when necessary, ICT training to end users, data entry operators and enumerators.",
      "In close coordination with the IMT Officer, implement the improvements to mission IT Infrastructure and the provision of services for the efficient functioning of mission operations.",
      "Facilitate the implementation of the ICT strategy in the Chad mission and actively coordinate ICT solutions or project components to meet the IT architecture review and other ICT frameworks.",
      "In close coordination with IMT Officer, liaise with Logistics and Procurement staff to facilitate the proper provision of ICT-related equipment/supplies/services and propose most suitable solutions.",
      "Provide training to ICT team members and other staff in the Mission.",
      "Perform such other duties as may be assigned."
    ],
    "salary_range": "N/A",
    "employment_type": "Full Time",
    "language": "en",
    "apply_url": "https://ngojobsinafrica.com/job/information-and-communications-technology-ict-officer-p2-ndjamena-chad/",
    "created_at": "February 12, 2026",
    "closing_date": "February 24, 2026"
  },
  {
    "id": 16,
    "title": "Digital and Innovation Assistant",
    "organization": "ForAfrika",
    "location": "Uganda",
    "description": "The Digital and Innovation Assistant will support the SMART Centre Project by managing digital systems, driving technology-based solutions, and providing training to staff, farmer cooperatives, and other stakeholders. This role ensures the effective use of digital tools, promotes digital literacy, and oversees all project digital activities, including the management of the computer training lab.\n\nBe able to trouble shoot all ICT related functions for the Centre as well as backs",
    "full_description": "The Digital and Innovation Assistant will support the SMART Centre Project by managing digital systems, driving technology-based solutions, and providing training to staff, farmer cooperatives, and other stakeholders. This role ensures the effective use of digital tools, promotes digital literacy, and oversees all project digital activities, including the management of the computer training lab.\n\nBe able to trouble shoot all ICT related functions for the Centre as well as backstopping for the entire country office locations when required.\n\nKey Roles and Responsibilities:\n1. Digital Systems and Innovation Management\n2. Training and Capacity Building\n3. Computer Lab Management\n4. Data Management and Reporting\n5. Support Functions",
    "requirements": [
      "Diploma or bachelor's degree in information technology, Computer Science, Digital Innovation, Business Information Systems, or a related field.",
      "At least 2 years of experience in digital systems management, IT support, training, or innovation-related roles.",
      "Experience in NGOs, community development, or agricultural projects is preferred.",
      "Experience training adult learners, farmer groups, or community stakeholders in digital skills.",
      "Strong digital literacy and proficiency in software applications (MS Office, Google Workspace, digital apps).",
      "Experience in digital marketing and online communication tools.",
      "Ability to train and support staff, farmer groups, and stakeholders in technology adoption.",
      "Basic IT troubleshooting and lab management skills.",
      "Strong organizational, reporting, and multitasking skills.",
      "Problem-solving mindset and ability to implement innovative solutions."
    ],
    "responsibilities": [
      "Maintain, update, and secure project digital platforms, databases, and tools.",
      "Oversee all digital activities within the project to ensure efficiency and innovation.",
      "Identify opportunities to improve project processes through technology and digital solutions.",
      "Train staff, farmer cooperatives/groups, and other stakeholders on computer technology basics, digital marketing techniques, and use of digital apps and platforms.",
      "Promote digital literacy and innovation among project participants.",
      "Manage the computer training lab, including scheduling, maintenance, and security of equipment.",
      "Collect, organize, and maintain project data in digital formats.",
      "Prepare digital reports, dashboards, and visualizations to support decision-making.",
      "Assist with digital communications, online outreach, and social media where necessary.",
      "Support procurement, logistics, and administrative functions with digital tracking and reporting."
    ],
    "salary_range": "N/A",
    "employment_type": "Fixed Term",
    "language": "en",
    "apply_url": "https://ngojobsinafrica.com/job/digital-and-innovation-assistant/",
    "created_at": "February 11, 2026",
    "closing_date": "February 19, 2026"
  },
  {
    "id": 17,
    "title": "Information Management Officer",
    "organization": "United Nations Children's Fund (UNICEF)",
    "location": "Maiduguri, Borno, Nigeria",
    "description": "To qualify as an advocate for every child you will have:\n\nEducational Qualification:\n- University Degree in Nutrition, Public Health, Epidemiology, Statistics or computer science/engineering or a related field with a nutrition focus.\n\nExperience:\n- Minimum of 2 years of professional experience in public health, nutrition, knowledge/data management or related field.\n- Strong knowledge of the programme and operating context in Northeast Nigeria is highly desirable.\n- Experience of nutrition data c",
    "full_description": "To qualify as an advocate for every child you will have:\n\nEducational Qualification:\n- University Degree in Nutrition, Public Health, Epidemiology, Statistics or computer science/engineering or a related field with a nutrition focus.\n\nExperience:\n- Minimum of 2 years of professional experience in public health, nutrition, knowledge/data management or related field.\n- Strong knowledge of the programme and operating context in Northeast Nigeria is highly desirable.\n- Experience of nutrition data collection, with extensive experience compiling and analyzing quantitative and qualitative data.\n- Proven experience in synthesizing relevant nutrition-related information and developing reports.",
    "requirements": [
      "University Degree in Nutrition, Public Health, Epidemiology, Statistics or computer science & engineering or a related field with a nutrition focus.",
      "Minimum of 2 years of professional experience in public health, nutrition, knowledge data management or related field in the country, experience of working in a humanitarian context and UN agencies will be an asset.",
      "Strong knowledge of, and working familiarity with, the programme and operating context in Northeast Nigeria is highly desirable.",
      "Experience of nutrition data collection, with extensive experience, compiling and analyzing quantitative and qualitative data and producing relevant graphical presentations of analysed data is mandatory.",
      "Proven experience in synthesizing relevant nutrition-related information and developing reports on time against set deadlines for the dissemination of key findings to technical and non-technical audiences is required.",
      "Fluency in English is required. Knowledge of the working language of the duty station as an asset."
    ],
    "responsibilities": [
      "Accountabilities, and Related Duties/Tasks",
      "Under the direct supervision of the Nutrition Manager, the Information Management Officer (IMO, DAE) will support in designing, planning and monitoring of nutrition assessments per national and international guidelines:",
      "Information Management Situation Monitoring, Assessment",
      "Evidence Generation and Knowledge Management: Support to programme development, planning, monitoring and advocacy",
      "Coordination and representation"
    ],
    "salary_range": "N/A",
    "employment_type": "Temporary Appointment",
    "language": "en",
    "apply_url": "https://ngojobsinafrica.com/job/information-management-officer-59/",
    "created_at": "February 7, 2026",
    "closing_date": "February 18, 2026"
  },
  {
    "id": 18,
    "title": "Tupande SAP Admin & Ops QC Coordinator",
    "organization": "One Acre Fund",
    "location": "Kenya",
    "description": "You will coordinate the Quality Control (QC) processes for all inventory movements. Your goal is to eliminate data errors, improve QC processes, oversee physical stock counts, and manage a team of SAP Data Entry & QC Admins to ensure 100% data integrity.",
    "full_description": "You will coordinate the Quality Control (QC) processes for all inventory movements. Your goal is to eliminate data errors, improve QC processes, oversee physical stock counts, and manage a team of SAP Data Entry & QC Admins to ensure 100% data integrity.",
    "requirements": [
      "Bachelor’s degree in Supply Chain Management, Information Technology, or related field.",
      "Proficiency in SAP, COBI WMS, or similar inventory management systems",
      "Strong skills in Excel, Google Spreadsheets and Power BI for analyzing data, tracking KPIs, and generating reports.",
      "Proven experience in leading inventory management, identifying discrepancies, and implementing corrective actions.",
      "High accuracy and integrity in managing inventory data, ensuring compliance with financial controls and SOPs.",
      "Excellent ability to communicate and collaborate with cross-functional teams and stakeholders.",
      "Strong organizational skills to lead QC initiatives, meet deadlines, and manage projects efficiently."
    ],
    "responsibilities": [
      "Inventory Oversight: Perform second-level checks on all transactions in SAP, COBI, and Odoo.",
      "Month-End Coordination: Lead the reconciliation of physical stock counts from Warehouses and Shops against system records.",
      "Process Management: Own the KPIs for data accuracy. You will update Standard Operating Procedures (SOPs) and conduct audits to ensure everyone follows the rules.",
      "Team Leadership: Manage and mentor a team of Quality Control Admins. You’ll handle their training, performance reviews, and daily task assignments.",
      "Reporting: Create reports on QC findings and root-cause analyses to help the business minimize waste and spend."
    ],
    "salary_range": "N/A",
    "employment_type": "Fixed Term",
    "language": "en",
    "apply_url": "https://ngojobsinafrica.com/job/tupande-sap-admin-ops-qc-coordinator/",
    "created_at": "February 7, 2026",
    "closing_date": "February 28, 2026"
  },
  {
    "id": 19,
    "title": "Tupande SAP Data Entry and Operations Admin – Senior Officer (Fixed-Term)",
    "organization": "One Acre Fund",
    "location": "Kenya",
    "description": "The role is responsible for executing data quality control QC for inventory transactions entered into SAP via WMS. This includes tracking and reporting on IDM-related KPIs and supporting additional data entry tasks for the BizOps IDM department",
    "full_description": "The role is responsible for executing data quality control QC for inventory transactions entered into SAP via WMS. This includes tracking and reporting on IDM-related KPIs and supporting additional data entry tasks for the BizOps IDM department. The role drives process improvements and innovations to enhance service delivery to farmers, ensuring all transactions are accurately tracked and quality-checked. By maintaining data integrity, the role ensures inventory flows correctly, ultimately improving efficiency and support to farmers",
    "requirements": [
      "Broad knowledge and experience in data entry",
      "Excellent skills in managing Google Sheets and Excel",
      "Demonstrated ability to work under tight timelines",
      "Demonstrated ability to be a team player"
    ],
    "responsibilities": [
      "Accurately perform QC on each SAP transaction on a daily basis",
      "Ability to use the QC checklist to perform thorough QC",
      "Ability to update the QC tool for each warehouse",
      "Support with following up on errors flagged",
      "Support with QC error correction",
      "Perform data entry for warehouse counts",
      "Accurately perform QC on warehouse counts for each warehouse."
    ],
    "salary_range": "N/A",
    "employment_type": "Full Time",
    "language": "en",
    "apply_url": "https://job-boards.greenhouse.io/oafkenya?error=true",
    "created_at": "February 7, 2026",
    "closing_date": "April 1, 2026"
  },
  {
    "id": 20,
    "title": "FEWS NET Uganda Country Technical Senior Specialist – Conflict",
    "organization": "Chemonics International Inc",
    "location": " Kampala, Uganda",
    "description": "The Famine Early Warning Systems Network (FEWS NET) is an integrated set of activities funded by the United States Government (USG) and is intended to provide timely, accurate, evidence-based, and transparent food insecurity early warning information and analysis",
    "full_description": "The Famine Early Warning Systems Network (FEWS NET) is an integrated set of activities funded by the United States Government (USG) and is intended to provide timely, accurate, evidence-based, and transparent food insecurity early warning information and analysis. Created in 1985 in response to famines in East and West Africa, FEWS NET provides global coverage of acute food insecurity. FEWS NET’s work is implemented across several mechanisms by a team of partners that includes the National Aeronautics and Space Administration (NASA), the National Oceanic and Atmospheric Administration (NOAA), the United States Department of Agriculture (USDA), the United States Geological Survey (USGS), the University of California-Santa Barbara’s Climate Hazards Center (UCSB-CHC), University of Maryland’s Department of Geographical Sciences, American Institutes for Research (AIR), and Chemonics International (Chemonics). Chemonics implements FEWS NET’s Decision Support Team (DST), which is charged with providing integrated monitoring and analyses of current and forecast acute food insecurity in countries worldwide to support the United States Government’s (USG) policy and programmatic decisions. The DST operates through a Washington-based technical office, regional FEWS NET offices, and national staff presence in sub-Saharan Africa, the Middle East, Asia, Latin America, and eastern Europe. ",
    "requirements": [
      "A bachelor’s degree in a discipline relevant to the work of FEWS NET, such as peace/conflict studies, international relations, political science, economics, agricultural economics, agronomy, climatology, anthropology, or social geography, is required; an advanced university degree (Master’s degree or higher) is desirable.",
      "At least five years of relevant experience (with a Master’s degree), or seven years of relevant experience (with a Bachelor’s degree) is required.",
      "Proficiency in written and spoken English is required; other local language skills relevant to the country are desirable.",
      "Excellent planning, organizational, analytical, and report-writing skills",
      "Demonstrated ability to work effectively with others at all levels, including an ability to effectively liaise with supervisors, national and sub-nationally government authorities, UN, NGO, and other relevant stakeholders, and an ability to coordinate effectively with remote colleagues",
      "Excellent computer skills, GIS applications, and mapping skills are desirable",
      "In-depth knowledge of context, dynamics and stakeholders in Uganda",
      "Unrestricted work authorization in Uganda"
    ],
    "responsibilities": [
      "Providing early warning analysis of conflict, and enhancing the project’s understanding of potential drivers of conflict",
      "Reviewing and providing guidance and inputs on conflict forecasts as a critical input to the Food Security Outlook and Food Security Outlook Update reports in collaboration with regional and country-level technical specialists to ensure alignment between conflict, livelihoods, agroclimatology, and markets and trade analyses",
      "Monitoring, assessing, and analyzing social, political, and/or economic events that are likely to have an impact on the trajectory or intensity of conflict for integration into conflict projections",
      "Supporting the collection, organization, and storage of primary and secondary conflict-related data and information, as directed, in support of the project’s integrated food security analysis and reporting",
      "Developing a strong subject matter expertise on political and conflict dynamics in the country.",
      "As directed by the Regional Technical Senior Specialist for Conflict (RTSS-C), engaging with the other mechanisms of FEWS NET and network partners to ensure the integration of available conflict-related analyses into the DST’s analyses and products, and to support the project’s continued development of conflict analysis approaches, tools, and guidance",
      "Contributing to the FEWS NET DST’s efforts to identify as early as possible potential or emerging conflict-related shocks as they pertain to acute food insecurity",
      "Under the guidance of the CTL, supporting the fulfilment of designated requirements related to food security analyses (FSOs, FSOUs, FAOB input) and monthly reporting, including providing critical inputs to the Food Security Outlooks (FSOs), FSO Updates, Price Watch, and Mey Messages; contributing to Food Assistance Outlook Brief reports; and providing briefings to national and sub-national partners",
      "Supporting the CTL in meeting USG’s expectations on timely delivery of national and sub-national decision support products, which include, but are not limited to: delivery of monthly reporting for all presence countries no later than 7 days after the last day of the reporting month; responding to urgent questions on acute food insecurity within one day; and providing briefings within one week of request",
      "Supporting the CTL and CTM where relevant, in maintaining a national and sub-national knowledge base comprised of, at a minimum, livelihood zone profiles, commodity trade flow maps, seasonal monitoring calendars, commodity price data, nutrition data, security monitoring, conflict data, migration, remittances, labor, humanitarian food assistance, and other technical data covering rainfall, agricultural production, population, etc., in collaboration with other FEWS NET 8 implementing partners, as applicable",
      "With support from the CTL, overseeing the collection of data by in-country enumerators or field monitors and liaising with the Regional Data Coordinator to ensure effective management (cleaning, storage, uploading, etc.) of all field data/information, and uploading to the FEWS NET Data Warehouse (FDW) where relevant",
      "Providing input into developing and updating national and sub-national seasonal monitoring plans and participating in national and sub-national acute food insecurity monitoring, as applicable",
      "Supporting proactive, high, and effective early warning of acute threats to food security at the national and sub-national levels, and supporting efforts to mitigate acute food insecurity and prevent food crises through effective communication of actionable food security analysis",
      "Supporting collaboration with Regional Technical Senior Specialists (RTSSs) to improve the integration of conflict into regular and ad hoc decision support products",
      "Developing and maintaining strong collaborative national and sub-national relations, both formal and informal, with USG representatives, US Embassy technical contacts, UN agency representatives, government ministry staff, and key international, regional, and national NGO counterparts to facilitate technical exchanges, promote consensus-building, and facilitate joint, coordinated actions to mitigate food insecurity.  ",
      "Conducting regular independent and joint field assessments of food security conditions in areas of most concern in the country, under the guidance of the CTL",
      "Collaborating with partners in food security monitoring and analysis in the country, including through participation in the Integrated Food Security Phase Classification (IPC) or Cadre Harmonisé (CH) protocols, as well as representing the project at formal and informal meetings, as delegated by the CTL",
      "Any other support as directed by the CTL, including supporting the development of annual workplans, organization of project documentation, contributing to information products, participating in network development and capacity strengthening efforts"
    ],
    "salary_range": "N/A",
    "employment_type": "Fixed Term",
    "language": "en",
    "apply_url": "https://chemonicsinternational-accna.formstack.com/forms/uganda_country_technical_sr_specialist_conflict",
    "created_at": "February 5, 2026",
    "closing_date": "February 18, 2026"
  },
  {
    "id": 21,
    "title": "Case Management Data Senior Specialist",
    "organization": "International Rescue Committee",
    "location": "Kenya",
    "description": "N/A",
    "full_description": "N/A",
    "requirements": [],
    "responsibilities": [],
    "salary_range": "N/A",
    "employment_type": "Full Time",
    "language": "en",
    "apply_url": "https://ngojobsinafrica.com/job/case-management-data-senior-specialist/",
    "created_at": "February 4, 2026",
    "closing_date": "March 4, 2026"
  },
  {
    "id": 22,
    "title": "Application Manager – Single Data Entry (SDE)",
    "organization": "Médecins Sans Frontières",
    "location": "Nairobi, Kenya",
    "description": "The primary role of the Case Management Data Senior Specialist is to strengthen the quality and use of case management data and information management systems (IMS) across IRC programming. ",
    "full_description": "The primary role of the Case Management Data Senior Specialist is to strengthen the quality and use of case management data and information management systems (IMS) across IRC programming. Key functions of this role include working with technical leads to maintain centralized guidance and protocols on case management IMS and data; supporting country teams with resources and system administration, rollout, and training for the Primero digital platform and other related platforms; streamlining and conducting regular data analysis across IMS platforms and protection streams; and engaging with global and country teams to gather feedback and provide targeted troubleshooting. In addition to this routine support, the Senior Specialist will also contribute to wider VPRU case management and learning strategy discussions, as well as external discussions on case management IMS and data practices.",
    "requirements": [
      "Specific experience with case management systems (particularly for gender-based violence, child protection, or protection rule of law) and/or protection programming, ideally in humanitarian contexts",
      "Strong experience with programmatic data collection, management, and analysis, including multiple data collection platforms and strong Excel skills",
      "Ability to generate high quality guidance and analysis documents that demonstrate attention to detail, strong understanding of best data practices, and are appropriate for end users",
      "Strong organizational skills and ability to balance multiple priorities across a diverse portfolio",
      "Excellent verbal and written communication skills, including an ability to be clear and concise",
      "Strong interpersonal skills: able to successfully listen to, collaborate with, facilitate discussion among, and build trust with people from diverse nationalities and backgrounds"
    ],
    "responsibilities": [
      "Provide centralized resources and support to ensure IRC teams have quality case management data systems and clear standards",
      "Develop and update comprehensive resources to strengthen teams’ understanding, use, and practice of case management IMS",
      "Maintain overall visibility and documentation on the state of IMS in each country and region and upcoming activities, in collaboration with technical teams",
      "Proactively collect feedback on IMS use and user needs, and identify challenges and solutions",
      "Provide guidance on data protection standards and expectations for case management",
      "Ensure clear connections between case management IMS and IRC MEAL systems",
      "Stay informed about emerging technologies and trends in case management systems, and advocate for necessary upgrades and enhancements as needed/feasible",
      "Provide direct technical support and system administration to country programs",
      "Support specific countries with rollout and configuration of Primero and other IMS platforms based on country needs (including through projects)",
      "Act as the system administrator and focal point for country programs utilizing protection-related information systems, including IRC instances of Primero",
      "Support ongoing training and capacity building on case management IMS with country program colleagues and VPRU technical advisors (TAs)",
      "Respond to requests for information sharing that follow IRC’s data protection standards",
      "Support regular data analysis and use of case management data by IRC programmatic teams",
      "Conduct regular and ad hoc analysis of case management data across protection streams and countries, including data compilation and cleaning",
      "Work with VPRU MEAL colleagues to streamline and harmonize case management measurement frameworks across protection streams",
      "Build capacity of technical advisors, regional colleagues, and country program colleagues to regularly analyze and use data to strengthen the quality of case management",
      "Triangulate case management data with other IRC data sources, e.g. Annual Statistics",
      "With VPRU MEAL Lead and technical leads, support strategy and vision for case management IMS for the IRC (across platforms, protection streams, and countries)",
      "Coordinate internally with IRC MEAL and Technology for Programs colleagues ",
      "With technical leads, track updates and co-represent IRC in external spaces related to case management IMS (e.g. inter-agency steering committees, Primero Board, etc.)",
      "Input into business development related to case management IMS, as appropriate"
    ],
    "salary_range": "N/A",
    "employment_type": "Fixed Term",
    "language": "en",
    "apply_url": "https://theirc.wd1.myworkdayjobs.com/External_Careers/job/New-York-NY-HQ-USA/Case-Management-Data-Senior-Specialist_JR00001854",
    "created_at": "February 3, 2026",
    "closing_date": "February 17, 2026"
  },
  {
    "id": 23,
    "title": "Strategic Information Advisor",
    "organization": "Jhpiego, an Affiliate of Johns Hopkins University",
    "location": "Abuja, Nigeria",
    "description": "he Strategic Information Advisor (MERL) will lead the Momentum Country and Global Leadership (MCGL), Integrated Health Project on all SI related implementation, research and data management.",
    "full_description": "The Strategic Information Advisor (MERL) will lead the Momentum Country and Global Leadership (MCGL), Integrated Health Project on all SI related implementation, research and data management. S/he will provide technical assistance and capacity building to the PRS department of the FMoH and counterparts at the State level and its stakeholders in the development of and implementation of RMNCAEH+N data analysis, use, and dissemination strategy. S/he will additionally design strategy and activities to improve capacity on triangulating data from multiple data sources to inform policy and decision-making. S/he will contribute to the design of robust, user-friendly, high-quality interfaces for data visualization and data dissemination to enhance state-led and nationally supported evidence-based programming for improved understanding of RMNCH quality of care interventions in relation to the Monitoring, Evaluation, Accountability, and Learning (MEAL) Plan developed by the national RMNCH QoC Technical Working Group (TWG). S/he will additionally provide technical assistance to design of implementation research and implement strategy to build capacity of M&E systems to oversee data quality and data use for decision making (including capacity building of M&E staff)",
    "requirements": [
      "Master’s degree in Public Health, Statistics, Epidemiology and other related fields with 8 years of experience in monitoring and evaluation in international development.",
      "Familiarity with USAID/RMNCH programs, Nigerian public sector health system and RMNCH response programs.",
      "Core Strategic Information experience, conversant with MER indicators, data collection, analysis and data visualization using DHIS, NDR, LAMIS, PowerBI etc.",
      "Demonstrated ability to be the technical specialist and as the lead subject matter expert in monitoring and evaluation.",
      "Demonstrated ability to perform complex data analytics utilizing Microsoft Excel, SPSS, STATA, Epi Info and/or other analytic software and to provide evidence-based recommendations accordingly.",
      "Demonstrated knowledge and experience in the use of GIS and other tools to support geospatial",
      "display of data to target program interventions and resources."
    ],
    "responsibilities": [
      "Provides technical support for the collection, analysis, triangulation and interpretation of RMNCH and MPDSR data and the calculation of programmatic, surveillance, demographic and epidemiological indicators;",
      "Oversee real-time data use including weekly, monthly and quarterly data review meetings; implement remediation efforts that address identified gaps and challenges for project overall and at national and state level.",
      "Oversee the development of learning questions for research implementation in partnership with consortium partners and the National QoC TWG.",
      "Oversee the engagement of six academic institutions from the six geopolitical zones that will conduct the agreed learning questions including coordinating the design of the research protocols, tools, IRB process, recruitment of data collectors, data collection and analysis and final reports working in partnership with the academic institutions and the QoC technical working group.",
      "Strengthen the use of data at the national and state level for program monitoring and improvement.",
      "Support the process of validation and triangulation of data between multiple data sources.",
      "Participates in the organization and facilitation of national M&E subcommittee, MPDSR committee performance meetings of the QoC TWG.",
      "Support the provision of training, supervision and mentorship to strengthen for M&E/SI and data quality improvement at national and State level in partnership with the FMoH, PRS department.",
      "Participate in the organization and facilitation of seminars, brainstorming workshops and workshops within their field of competence, whenever this is required;",
      "Prepares periodic reports of activities, donor reports, QoC TWG reports; and",
      "Performs other duties as assigned."
    ],
    "salary_range": "N/A",
    "employment_type": "N/A",
    "language": "en",
    "apply_url": "https://jobs-jhpiego.icims.com/jobs/search?ss=1&notFound=1&mobile=false&width=1524&height=500&bga=true&needsRedirect=false&jan1offset=-300&jun1offset=-240",
    "created_at": "N/A",
    "closing_date": "N/A"
  },
  {
    "id": 24,
    "title": "Senior Officer Graphic Designer",
    "organization": "RefugePoint",
    "location": "Nairobi, Kenya",
    "description": "The Graphic Designer plays a key role in bringing RefugePoint’s mission, impact, and stories to life through compelling, mission-aligned visual design.",
    "full_description": "The Graphic Designer plays a key role in bringing RefugePoint’s mission, impact, and stories to life through compelling, mission-aligned visual design. This role will join RefugePoint’s Communications team and will lead the design process for major organizational publications, including RefugePoint’s annual and quarterly reports, impact data visualization, and web design updates, while also supporting the Communications team and the broader organization with high-quality design across print and digital platforms. The Graphic Designer translates complex data, programmatic work, and human stories into clear, engaging visuals—including strong data visualizations—that support fundraising, outreach, advocacy, and brand awareness. Working collaboratively across teams, this role ensures visual consistency, accessibility, and excellence across all materials, while adapting designs for a range of audiences, channels, and formats.",
    "requirements": [
      "Must be legally able to live and work in Kenya.",
      "Bachelor’s degree in Graphic Design, Visual Communications, or a related field (or equivalent professional experience).",
      "3+ years of professional graphic design experience (in-house, agency, or freelance).",
      "Strong portfolio demonstrating excellence in visual storytelling, branding, and layout design.",
      "Strong attention to detail and commitment to high-quality work."
    ],
    "responsibilities": [
      "Lead key publications: Manage and execute the full design process for RefugePoint’s annual report and quarterly reports, from concept development through final production, ensuring accuracy, clarity, and strong visual storytelling.",
      "Create marketing and communications collateral: Design a wide range of materials including one-pagers, brochures, social media graphics, infographics, email graphics, digital ads, and other campaign assets to support fundraising, outreach, and advocacy efforts.",
      "Support events and fundraising initiatives: Produce materials such as invitations, swag, signage, banners, backdrops, and promotional graphics for events and convenings.",
      "Maintain brand consistency: Apply and uphold RefugePoint’s visual identity—logos, color palettes, typography, and design standards—across all materials, ensuring consistency and cohesion across platforms.",
      "Visual storytelling & data translation: Transform complex information, impact data, and refugee stories into accessible, compelling infographics and visual narratives for both print and digital use.",
      "Collaborate across teams: Work closely with Communications, Programs, Development, and other teams to understand project goals, audiences, and messaging, and translate them into effective visual solutions.",
      "Concept development & execution: Brainstorm and develop design concepts, then execute them using industry-standard tools (e.g., Adobe Creative Suite), incorporating feedback and refining designs through multiple iterations as needed.",
      "Design adaptation: Prepare and adapt designs for various formats and channels (web, social, email, print), ensuring technical specifications and accessibility standards are met.",
      "Asset management: Organize and maintain RefugePoint’s digital asset library, including design files, templates, photos, and graphics, to support efficient collaboration and reuse."
    ],
    "salary_range": "Kes. 236,282",
    "employment_type": "N/A",
    "language": "en",
    "apply_url": "https://refugepoint.applicantstack.com/x/detail/a25lemtjzzfn",
    "created_at": "N/A",
    "closing_date": "N/A"
  },
  {
    "id": 26,
    "title": "Uganda Data and Systems Lead (Fixed Term)",
    "organization": "One Acre Fund",
    "location": "Jinja, Uganda - Hybrid",
    "description": "As the Data, Analytics & Systems Lead, you will oversee strategic Data and Systems projects. You will make data-driven recommendations and oversee systems initiatives that increase program impact and improve our daily operations in terms of farmer adoption, repayment, market access and input logistics",
    "full_description": "As the Data, Analytics & Systems Lead, you will oversee strategic Data and Systems projects. You will make data-driven recommendations and oversee systems initiatives that increase program impact and improve our daily operations in terms of farmer adoption, repayment, market access and input logistics. You will perform high-level statistical and business analyses, and provide solutions and recommendations to improve our program's operational performance. You will manage and develop data collection protocols, business performance indicators, and leverage industry trends, market intelligence, and customer information to develop analytical tools, reports and models to inform and support decision-making. Success will be determined by the development and implementation of comprehensive analytical solutions to provide critical insights for decision-making, program-wide operational improvements and future business initiatives. You will manage a small team of Regional Data Analysts. You will also oversee a small Business Operations & Logistics team. You will regularly collaborate with different teams and departments, and will report to the C-suite. This will be a hybrid role; working flexibly as needed between the field, our regional offices, and remotely.",
    "requirements": [
      "Bachelor's degree in Statistics, Data Science, Analytics, Applied Mathematics, Quantitative Economics, or another relevant field.",
      "5+ years of experience in a strategic data and/or analytical role.",
      "Strong statistics and analytical skills in R, Advanced Excel / Google Sheets (can develop and maintain complex spreadsheets), CommCare, Kobo and other data collection, analysis and data visualization tools. Experience in SQL, Dataiku, Superset, and PowerBi will be an added bonus.",
      "Critical and strategic thinking skills; with the ability to act fast and synthesize, translate qualitative and quantitative data into practical strategy recommendations and business needs into technical solutions.",
      "Strong communication, writing, and interpersonal skills will also be important for the role.",
      "Project management: Ability to balance multiple strategic projects and priorities at once, effectively collaborating across teams and functions to influence and quickly execute against strategy.",
      "Proven experience managing and upskilling a team and a willingness to teach others"
    ],
    "responsibilities": [
      "Program Data Management, Analytics & Business Intelligence",
      "You'll develop and implement a data strategy that supports decision-making across different organizational departments.",
      "You'll design and standardize data collection tools and processes, and manage field implementation of the same across teams and regions.",
      "You'll develop and maintain single-source-of-truth program performance dashboards across teams and regions.",
      "In collaboration with country leadership, you will monitor and effectively communicate cross-program performance and provide insights as well as corrective actions and recommendations to ensure organizational objectives are met.",
      "You'll manage and analyze program performance data from multiple applications or sources, including field research; using this to prepare materials to support management meetings and decisions, such as summary performance highlights and deep-dive longitudinal trends to identify opportunities for execution improvement.",
      "You'll develop performance management tools that look at teams' efficiency and effectiveness.",
      "You will work with our Monitoring, Evaluation & Learning (MEL) team to integrate our in-season farmer data with our end-of-season MEL data across all regions to build a year-round narrative and understanding of our farmers and customers with respect to MEL's annual program impact evaluations and assessments.",
      "You'll collaborate with program stakeholders and internal and external data teams to ensure and improve data availability, integrity, accuracy, and reliability.",
      "You will work closely with the Global Data Team to develop and validate predictive models, forecasts or other program performance tools.",
      "Innovations, R&D & Trial Management:",
      "You'll manage Innovations data collection and analysis across ideation, R&D, field and farmer trials, and product scale and rollout; organizing, collaborating, and coordinating closely with various program teams and stakeholders on trial delivery and implementation.",
      "Team Management & Data Skills Development:",
      "You will manage and mentor a team of Regional Data Analysts and lead the recruitment of new analysts.",
      "You will oversee the work of a small Business Operations & Logistics team and line manage its Team Lead. You will work with the Team Lead on ensuring technical platforms and processes support effective inventory management, efficient field team operations, and a positive client experience.",
      "You will train and improve data management and analytical capabilities across regional teams and functions, developing survey design skills, data collection tool fluency, and data handling and analysis skills for the stakeholders across our teams that interface with data on a regular basis.",
      "Run the annual goal setting and planning process for Data & Systems in line with the Uganda program vision and targets. Measure and report on progress against SMART OKRs.",
      "Field Presence & Support:",
      "You'll conduct regular field visits to regional operations to build field fluency, and to understand the operational and implementation context around incoming data, longitudinal trends, and emerging challenges."
    ],
    "salary_range": "N/A",
    "employment_type": "N/A",
    "language": "en",
    "apply_url": "https://oneacrefund.org/vacancies/uganda-data-and-systems-lead-fixed-term?gh_jid=7486513&gh_src=rxz23gpj1us",
    "created_at": "N/A",
    "closing_date": "N/A"
  },
  {
    "id": 27,
    "title": "Uganda Data and Systems Lead (Fixed Term)",
    "organization": "One Acre Fund",
    "location": "Jinja, Uganda",
    "description": "s the Data, Analytics & Systems Lead, you will oversee strategic Data and Systems projects. You will make data-driven recommendations and oversee systems initiatives that increase program impact and improve our daily operations in terms of farmer adoption, repayment, market access and input logistics.",
    "full_description": "As the Data, Analytics & Systems Lead, you will oversee strategic Data and Systems projects. You will make data-driven recommendations and oversee systems initiatives that increase program impact and improve our daily operations in terms of farmer adoption, repayment, market access and input logistics. You will perform high-level statistical and business analyses, and provide solutions and recommendations to improve our program's operational performance. You will manage and develop data collection protocols, business performance indicators, and leverage industry trends, market intelligence, and customer information to develop analytical tools, reports and models to inform and support decision-making. Success will be determined by the development and implementation of comprehensive analytical solutions to provide critical insights for decision-making, program-wide operational improvements and future business initiatives. You will manage a small team of Regional Data Analysts. You will also oversee a small Business Operations & Logistics team. You will regularly collaborate with different teams and departments, and will report to the C-suite. This will be a hybrid role; working flexibly as needed between the field, our regional offices, and remotely.",
    "requirements": [
      "Bachelor's degree in Statistics, Data Science, Analytics, Applied Mathematics, Quantitative Economics, or another relevant field.",
      "5+ years of experience in a strategic data and/or analytical role.",
      "Strong statistics and analytical skills in R, Advanced Excel / Google Sheets (can develop and maintain complex spreadsheets), CommCare, Kobo and other data collection, analysis and data visualization tools. Experience in SQL, Dataiku, Superset, and PowerBi will be an added bonus.",
      "Critical and strategic thinking skills; with the ability to act fast and synthesize, translate qualitative and quantitative data into practical strategy recommendations and business needs into technical solutions.",
      "Strong communication, writing, and interpersonal skills will also be important for the role.",
      "Project management: Ability to balance multiple strategic projects and priorities at once, effectively collaborating across teams and functions to influence and quickly execute against strategy.",
      "Proven experience managing and upskilling a team and a willingness to teach others"
    ],
    "responsibilities": [
      "Program Data Management, Analytics & Business Intelligence",
      "You'll develop and implement a data strategy that supports decision-making across different organizational departments.",
      "You'll design and standardize data collection tools and processes, and manage field implementation of the same across teams and regions.",
      "You'll develop and maintain single-source-of-truth program performance dashboards across teams and regions.",
      "In collaboration with country leadership, you will monitor and effectively communicate cross-program performance and provide insights as well as corrective actions and recommendations to ensure organizational objectives are met.",
      "You'll manage and analyze program performance data from multiple applications or sources, including field research; using this to prepare materials to support management meetings and decisions, such as summary performance highlights and deep-dive longitudinal trends to identify opportunities for execution improvement.",
      "You'll develop performance management tools that look at teams' efficiency and effectiveness.",
      "You will work with our Monitoring, Evaluation & Learning (MEL) team to integrate our in-season farmer data with our end-of-season MEL data across all regions to build a year-round narrative and understanding of our farmers and customers with respect to MEL's annual program impact evaluations and assessments.",
      "You'll collaborate with program stakeholders and internal and external data teams to ensure and improve data availability, integrity, accuracy, and reliability.",
      "You will work closely with the Global Data Team to develop and validate predictive models, forecasts or other program performance tools.",
      "Innovations, R&D & Trial Management:",
      "You'll manage Innovations data collection and analysis across ideation, R&D, field and farmer trials, and product scale and rollout; organizing, collaborating, and coordinating closely with various program teams and stakeholders on trial delivery and implementation.",
      "Team Management & Data Skills Development:",
      "You will manage and mentor a team of Regional Data Analysts and lead the recruitment of new analysts.",
      "You will oversee the work of a small Business Operations & Logistics team and line manage its Team Lead. You will work with the Team Lead on ensuring technical platforms and processes support effective inventory management, efficient field team operations, and a positive client experience.",
      "You will train and improve data management and analytical capabilities across regional teams and functions, developing survey design skills, data collection tool fluency, and data handling and analysis skills for the stakeholders across our teams that interface with data on a regular basis.",
      "Run the annual goal setting and planning process for Data & Systems in line with the Uganda program vision and targets. Measure and report on progress against SMART OKRs.",
      "Field Presence & Support:",
      "You'll conduct regular field visits to regional operations to build field fluency, and to understand the operational and implementation context around incoming data, longitudinal trends, and emerging challenges."
    ],
    "salary_range": "N/A",
    "employment_type": "N/A",
    "language": "en",
    "apply_url": "https://oneacrefund.org/vacancies/uganda-data-and-systems-lead-fixed-term?gh_jid=7486513&gh_src=rxz23gpj1us",
    "created_at": "N/A",
    "closing_date": "19 March 2026"
  }
]